
&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	НазваниеТовара = Ждать ВвестиСтрокуАсинх("", "Введите название товара");
	
	Если ПроверитьСуществованиеТовара(НазваниеТовара) Тогда
		ТекстСообщения = СтрШаблон("Товар %1 найден", НазваниеТовара);
	Иначе
		ТекстСообщения = СтрШаблон("Товар %1 не найден", НазваниеТовара);
	КонецЕсли;	
		
		Сообщить(ТекстСообщения);

КонецПроцедуры

&НаСервере
Функция ПроверитьСуществованиеТовара(НазваниеТовара)
	
	ТаблицаТоваров = Новый ТаблицаЗначений();
	ТаблицаТоваров.Колонки.Добавить("Название");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	
	СтрокаТоваров = ТаблицаТоваров.Добавить();
	СтрокаТоваров.Название = "Микрофон";
	СтрокаТоваров.Цена = 100;
	
	СтрокаТоваров = ТаблицаТоваров.Добавить();
	СтрокаТоваров.Название = "Гитара";
	СтрокаТоваров.Цена = 600;
	
	ТоварСуществует = Справочники.Товары.ПроверитьСуществованиеТовара(НазваниеТовара);
	Возврат ТоварСуществует;
КонецФункции